zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_dts.c
    /* Wait till TS1_RDY flag is set */
    while (__HAL_DTS_GET_FLAG(hdts, DTS_FLAG_TS1_RDY) == 0U)
    {
      if ((HAL_GetTick() - tickstart) > DTS_DELAY_STARTUP)
      {
        return HAL_TIMEOUT;
      }
    }

    if (__HAL_DTS_GET_TRIGGER(hdts) == DTS_TRIGGER_HW_NONE_CONT)
    {
      /* Start continuous measures */
      SET_BIT(hdts->Instance->CFGR1, DTS_CFGR1_TS1_START);

      /* Ensure start is taken into account */
      HAL_Delay(TS_TIMEOUT_MS);
    }

    hdts->State = HAL_DTS_STATE_READY;
  }
  else
  {
    return HAL_BUSY;
  }

  return HAL_OK;
}

/**
  * @brief  Stop the DTS Sensor.
  * @param  hdts  DTS handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DTS_Stop(DTS_HandleTypeDef *hdts)
{
  /* Check the DTS handle allocation */
  if (hdts == NULL)
  {
    return HAL_ERROR;
  }
  if (hdts->State == HAL_DTS_STATE_READY)
  {
    hdts->State = HAL_DTS_STATE_BUSY;

    if (__HAL_DTS_GET_TRIGGER(hdts) == DTS_TRIGGER_HW_NONE_CONT)
    {
      CLEAR_BIT(hdts->Instance->CFGR1, DTS_CFGR1_TS1_START);

      /* Ensure stop is taken into account */
      HAL_Delay(TS_TIMEOUT_MS);
    }

    /* Disable the selected DTS sensor */
    __HAL_DTS_DISABLE(hdts);

    hdts->State = HAL_DTS_STATE_READY;
  }
  else
  {
    return HAL_BUSY;
  }

  return HAL_OK;
}

/**
  * @brief  Enable the interrupt(s) and start the DTS sensor
  * @param  hdts  DTS handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DTS_Start_IT(DTS_HandleTypeDef *hdts)
{
  uint32_t tickstart;
  assert_param(IS_DTS_INTERRUPTSOURCE(hdts->Init.InterruptSource));

  /* Check the DTS handle allocation */
  if (hdts == NULL)
  {
    return HAL_ERROR;
  }

  if (hdts->State == HAL_DTS_STATE_READY)
  {
    hdts->State = HAL_DTS_STATE_BUSY;

    /* On Asynchronous mode enable the DTS EXTI line */
    if ((hdts->Init.InterruptSource & DTS_IT_ASYNC) != 0U)
    {
      if (__HAL_DTS_GET_REFCLK(hdts, DTS_REFCLKSEL_LSE) == 0U)
      {
        return HAL_ERROR;
      }
      else
      {
        __HAL_DTS_EXTI_ENABLE_IT();
      }
    }

    /* Enable the IT(s) */
    __HAL_DTS_ENABLE_IT(hdts, hdts->Init.InterruptSource);

    /* Enable the selected DTS sensor */
    __HAL_DTS_ENABLE(hdts);

    /* Get Start Tick*/
    tickstart = HAL_GetTick();

    /* Wait till TS1_RDY flag is set */
    while (__HAL_DTS_GET_FLAG(hdts, DTS_FLAG_TS1_RDY) == 0U)
    {
      if ((HAL_GetTick() - tickstart) > DTS_DELAY_STARTUP)
      {
        return HAL_TIMEOUT;
      }
    }

    if (__HAL_DTS_GET_TRIGGER(hdts) == DTS_TRIGGER_HW_NONE_CONT)
    {
      /* Start continuous measures */
      SET_BIT(hdts->Instance->CFGR1, DTS_CFGR1_TS1_START);

      /* Ensure start is taken into account */
      HAL_Delay(TS_TIMEOUT_MS);
    }

    hdts->State = HAL_DTS_STATE_READY;
  }
  else
  {
    return HAL_BUSY;
  }

  return HAL_OK;
}

/**
  * @brief  Disable the interrupt(s) and stop the DTS sensor.
  * @param  hdts  DTS handle
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DTS_Stop_IT(DTS_HandleTypeDef *hdts)
{
  assert_param(IS_DTS_INTERRUPTSOURCE(hdts->Init.InterruptSource));

  /* Check the DTS handle allocation */
  if (hdts == NULL)
  {
    return HAL_ERROR;
  }

  if (hdts->State == HAL_DTS_STATE_READY)
  {
    hdts->State = HAL_DTS_STATE_BUSY;

    if (__HAL_DTS_GET_TRIGGER(hdts) == DTS_TRIGGER_HW_NONE_CONT)
    {
      CLEAR_BIT(hdts->Instance->CFGR1, DTS_CFGR1_TS1_START);

      /* Ensure stop is taken into account */
      HAL_Delay(TS_TIMEOUT_MS);
    }

    /* Disable the selected DTS sensor */
    __HAL_DTS_DISABLE(hdts);

    __HAL_DTS_DISABLE_IT(hdts, hdts->Init.InterruptSource);

    /* On Asynchronous mode disable the DTS EXTI line */
    if ((hdts->Init.InterruptSource & DTS_IT_ASYNC) != 0U)
    {
      __HAL_DTS_EXTI_DISABLE_IT();
    }

    hdts->State = HAL_DTS_STATE_READY;
  }
  else
  {
    return HAL_BUSY;
  }

  return HAL_OK;
}

/**
  * @brief  Get temperature from DTS
  * @param  hdts  DTS handle
  * @param  Temperature  Temperature in deg C
  * @note This function retrieves latest available measure
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_DTS_GetTemperature(DTS_HandleTypeDef *hdts, int32_t *Temperature)
{
  uint32_t tickstart;
  uint32_t freq_meas;
  uint32_t samples;
  uint32_t t0_temp;
  uint32_t t0_freq;
  uint32_t ramp_coeff;
  uint32_t count_read = 0UL;
  uint32_t tmp_smp_time;

  /* Software trigger */
  if (hdts->State == HAL_DTS_STATE_READY)
  {
    hdts->State = HAL_DTS_STATE_BUSY;
    if ((__HAL_DTS_GET_TRIGGER(hdts) == DTS_TRIGGER_HW_NONE)  &&
        (__HAL_DTS_GET_TRIGGER(hdts) != DTS_TRIGGER_HW_NONE_CONT))
    {
      /* Start measure */
      SET_BIT(hdts->Instance->CFGR1, DTS_CFGR1_TS1_START);

      /* Ensure start is taken into account */
      HAL_Delay(TS_TIMEOUT_MS);

      /* Stop measure */
      CLEAR_BIT(hdts->Instance->CFGR1, DTS_CFGR1_TS1_START);

      /* Get Start Tick*/
      tickstart = HAL_GetTick();

      /* Wait till TS1_RDY flag is set */
      while (__HAL_DTS_GET_FLAG(hdts, DTS_FLAG_TS1_RDY) == 0U)
      {
        count_read++;
        if ((HAL_GetTick() - tickstart) > TS_TIMEOUT_MS)
        {
          hdts->Measure.Ts1_Count_R = count_read;
          hdts->Measure.Ts1_Sample = (hdts->Instance->DR & DTS_DR_TS1_MFREQ);
          return HAL_TIMEOUT;
        }
      }
    }

    /* Get the total number of samples */
    samples = (hdts->Instance->DR & DTS_DR_TS1_MFREQ);

    /* Save the total number of samples (debug). */
    hdts->Measure.Ts1_Sample = samples;

    if (samples == 0U)
    {
      hdts->State = HAL_DTS_STATE_READY;
      return HAL_ERROR;
    }

    tmp_smp_time = ((hdts->Instance->CFGR1 & DTS_CFGR1_TS1_SMP_TIME) >> DTS_CFGR1_TS1_SMP_TIME_Pos);
    if (tmp_smp_time == 0UL)
    {
      tmp_smp_time = 1UL;
    }

    if ((hdts->Instance->CFGR1 & DTS_CFGR1_REFCLK_SEL) == DTS_REFCLKSEL_LSE)
    {
      freq_meas = LSE_VALUE * samples / tmp_smp_time ; /* On Hz */
    }
    else
    {
      freq_meas = ((uint32_t)HS_CLK_FREQ / samples) * tmp_smp_time;   /* On Hz */
    }

    /* Save measured frequency (debug) */
    hdts->Measure.Ts1_Fmt = freq_meas;

    /* Read factory settings */
    t0_temp = hdts->Instance->T0VALR1 >> DTS_T0VALR1_TS1_T0_Pos;
    if (t0_temp == 0UL)
    {
      t0_temp = DTS_FACTORY_TEMPERATURE1; /* 30 deg C */
    }
    else if (t0_temp == 1UL)
    {
      t0_temp = DTS_FACTORY_TEMPERATURE2; /* 130 deg C */
    }
    else
    {
      hdts->State = HAL_DTS_STATE_READY;
      return HAL_ERROR;
    }
    t0_freq = (hdts->Instance->T0VALR1 & DTS_T0VALR1_TS1_FMT0) * 100UL; /* Hz */
    ramp_coeff = hdts->Instance->RAMPVALR & DTS_RAMPVALR_TS1_RAMP_COEFF; /* deg C/Hz */

    if (ramp_coeff == 0U)
    {
      hdts->State = HAL_DTS_STATE_READY;
      return HAL_ERROR;
    }

